insert into artists(nickname)
values('Сергей Лазарев'), ('Ани Лорак'), ('Баста'), ('Гуф'), ('Шакира'), ('Татьяна Куртукова'), ('Лариса Долина')


insert into genres(title)
values('Поп'), ('Рок'), ('Народный'), ('Джаз'), ('Рэп')


insert into albums(title, year_of_release)
values('Белые розы', '1999-01-02'), ('Ночной капкан', '1985-03-21'), ('Что по чём', '2022-11-17'), ('Я слуга народа', '2020-09-11'), ('Жить', '2019-05-14')

insert into tracks(title, duration, album_id)
values('Твои глаза', 3.55, 1), ('Колыбельная', 2.30, 2), ('Снег в окене', 1.50, 3), ('Позови меня с собой', 2.44, 4), ('Мой милый', 1.11, 4), ('Кукушка', 1.37, 5), ('Пачка сигарет', 2.70, 5), ('Алюминиевые огурцы', 2.91, 5), ('Спектакль окончен', 3.15, 3), ('Рюмка водки', 4.00, 2) 

insert into compilations(title, year_of_releas)
values('Прекрасное', '2021-04-05'), ('Ужасное', '2001-01-28'), ('Нормальное', '2011-10-19'), ('Адекватное', '2019-08-23'), ('Весёлое', '2018-06-12')

insert into artistsgenres
values(1, 1), (2, 1), (3, 1), (3, 5), (4, 5), (5, 1), (5, 2), (6, 1), (6, 3), (7, 1), (7, 4)

insert into artistsalbums
values(2, 1), (1, 2), (3, 3), (6, 4), (7, 5)

insert into compilationstracks
values(1, 1), (1, 3), (3, 5), (4, 8), (4, 9), (5, 10), (1, 2), (2, 4), (5, 6)